import { Component } from '@angular/core';
import { Router, NavigationExtras } from '@angular/router';

@Component({
  selector: 'app-home',
  templateUrl: 'home.page.html',
  styleUrls: ['home.page.scss'],
})
export class HomePage {
  places = [
    {
      title: "น้ําตกทอทิพย์",
      image: "http://www.chaambeach.com/travel/tortip-waterfall/phetchaburi-tortip-waterfall-travel1.jpg",
      detail: `น้ําตกทอทิพย์ อุทยานแห่งชาติแก่งกระจาน อ.แก่งกระจาน จ.เพชรบุรี น้ําตกทอทิพย์
        อุทยานแห่งชาติแก่งกระจาน ต้นกำเนิดของน้ำตกอยู่ที่เขาพะเนินทุ่ง น้ำตกทอทิพย์ อยู่ห่างจากเขาพะเนินทุ่ง 15 กิโลเมตร
        สามารถเดินทางโดยรถยนต์ และเดินทางเท้าเข้าถึงตัวน้ำตกประมาณ 4 กิโลเมตร มีความสูง 9 ชั้น ชั้นที่ 5
        เป็นชั้นที่สวยที่สุด แต่ละชั้นสวยงามแปลกตา สภาพโดยรอบเป็นป่าไม้ร่มรื่น
        อยู่ห่างจากยอดเขาพะเนินทุ่งประมาณ 4 กิโลเมตร ซึ่งสามารถจะเดินทางไปชมโดยทางรถยนต์
        จุดเริ่มต้นของทางลงเขาสู่น้ำตกทอทิพย์อยู่บริเวณ กม. 36 สุดทางของเส้นทางสายวังวน-พะเนินทุ่ง
        เป็นทางดิ่งลงเขาตลอดระยะทาง 4 กิโลเมตร ตัวน้ำตกมีถึง 9 ชั้น สายน้ำไหลลดหลั่นลงมาเป็นทางยาวตามความชันของพื้นที่
        สามารถเดินเลาะข้างน้ำตกลงมาจนครบทุกชั้น ปลายทางของสายน้ำจะไหลลงสู่แม่น้ำเพชรบุรี
        ทั้งนี้การเดินทางไปยังแหล่งท่องเที่ยวที่อยู่ลึกเข้าไปในผืนป่า ควรขอคำแนะนำและคนนำทางจากเจ้าหน้าที่ป่าไม้ก่อน
        นอกจากนี้ รถยนต์ที่ใช้ต้องมีกำลังเครื่องดีเพราะเส้นทางผ่านหุบเขาลาดชัน`
    },
    {
      title: "น้ำตกทรายขาว",
      image: "https://upload.wikimedia.org/wikipedia/th/thumb/3/33/%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%95%E0%B8%81%E0%B8%97%E0%B8%A3%E0%B8%B2%E0%B8%A2%E0%B8%82%E0%B8%B2%E0%B8%A7.jpg/250px-%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%95%E0%B8%81%E0%B8%97%E0%B8%A3%E0%B8%B2%E0%B8%A2%E0%B8%82%E0%B8%B2%E0%B8%A7.jpg",
      detail: `น้ำตกทรายขาว เดิมเรียกว่า “น้ำตกกระโถน”[1] ซึ่งมีต้นน้ำเกิดจากยอดเขานางจันทร์ในบริเวณทิวเขาทรายขาว
        เทือกเขาสันกาลาคีรี และถูกค้นพบโดย “พระครูศรีรัตนากร (ท่านสีแก้ว)” ซึ่งเป็นเจ้าเจ้าอาวาสอยู่วัดทรายขาว เมื่อปี 2475
        บริเวณอุทยานแห่งชาติน้ำตกทรายขาวมีพื้นที่ครอบคลุมป่าสงวนแห่งชาติเขาใหญ่ ในท้องที่อำเภอโคกโพธิ์ จังหวัดปัตตานี
        อำเภอเมืองยะลา อำเภอยะหา จังหวัดยะลา และป่าสงวนแห่งชาติป่าเทือกเขาสันกาลาคีรี ในท้องที่อำเภอสะบ้าย้อย จังหวัดสงขลา
        มีจุดเด่นตามธรรมชาติและน้ำตกที่สวยงาม ซึ่งมีสภาพป่าอุดมสมบูรณ์
        ร่มรื่นไปด้วยพันธุ์ไม้และสัตว์ป่านานาชนิดที่ควรแก่การศึกษาหาความรู้เป็นอย่างมาก ซึ่งมีเนื้อที่ครอบคลุมประมาณ 68,750
        ไร่ หรือกว่า 110 ตารางกิโลเมตร`
    },
    {
      title: "น้ำตกสีฟ้าเขียวมรกต",
      image: "https://s359.kapook.com/pagebuilder/625756f4-d02b-4db2-b392-10d12e9aabb7.jpg",
      detail: `น้ำตกห้วยแม่ขมิ้น ตั้งอยู่ที่ตำบลท่ากระดาน อำเภอศรีสวัสดิ์ จังหวัดกาญจนบุรี ภายในอุทยานแห่งชาติเขื่อนศรีนครินทร์ มีลักษณะเป็นน้ำตกขนาดใหญ่ เกิดจากลำห้วยแม่ขมิ้นที่ไหลผ่านเทือกเขาหินปูนลดหลั่นลงมาเป็นชั้น ๆ มีทั้งหมด 7 ชั้น ระยะทางรวม 2,270 เมตร โดยน้ำในน้ำตกจะมีสีเขียวมรกตสวยใส เห็นได้ชัดในบริเวณแอ่งน้ำกว้างของแต่ละชั้น บรรยากาศโดยรอบงดงาม เต็มไปด้วยต้นไม้น้อยใหญ่สีเขียว ร่มรื่น อากาศเย็นสบายสดชื่น มีเส้นทางศึกษาธรรมชาติให้ได้เดินเที่ยวชม เปิดให้เข้าเที่ยวชมทุกวัน ตั้งแต่เวลา 08.00-17.00 น. ค่าธรรมเนียมคนไทย ผู้ใหญ่ 100 บาท เด็ก 50 บาท ชาวต่างชาติ ผู้ใหญ่ 300 บาท เด็ก 200 บาท ดูรายละเอียดเพิ่มเติมได้ที่ park.dnp.go.th`
    },
  ];
  constructor(
    private router: Router
  ) { }
  goToPlace(place) {
    let navigationExtras: NavigationExtras = {
      queryParams: {
        place: JSON.stringify(place)
      }
    };
    this.router.navigate(['/place'], navigationExtras);
  }
}
